ps2chiper/framework-ch579x/CMSIS/SVD/CH579SFR.svd
<?xml version="1.0" encoding="utf-8"?>

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd" >
  <vendor>WCH Ltd.</vendor>                                       <!-- device vendor name -->
  <vendorID>WCH</vendorID>                                        <!-- device vendor short name -->
  <name>CH579SFR</name>                                        <!-- name of part-->
  <series>CH57x</series>                                         <!-- device series the device belongs to -->
  <version>1.0</version>                                          <!-- version of this description, adding CMSIS-SVD 1.1 tags -->
  <description>WCH wireless MCU CH57x Family Support, Drivers</description>
  <cpu>                                                           <!-- details about the cpu embedded in the device -->
    <name>CM0</name>
    <revision>r0p0</revision>
    <endian>little</endian>
    <mpuPresent>false</mpuPresent>
    <fpuPresent>false</fpuPresent>
    <nvicPrioBits>2</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>                            <!-- byte addressable memory -->
  <width>32</width>                                               <!-- bus width is 32 bits -->
  <!-- default settings implicitly inherited by subsequent sections -->
  <size>32</size>                                                 <!-- this is the default size (number of bits) of all peripherals
                                                                       and register that do not define "size" themselves -->
  <resetValue>0x00000000</resetValue>                             <!-- by default all bits of the registers are initialized to 0 on reset -->
  <resetMask>0xFFFFFFFF</resetMask>                               <!-- by default all 32Bits of the registers are used -->

  <peripherals>
    <peripheral>
      <name>SYS</name>
      <description>System Control Register</description>
      <groupName>SystemControl</groupName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0x00</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO</name>
		<description>GPIO_IRQHandler</description>
        <value>1</value>
      </interrupt>
	  <interrupt>
		<name>SLAVE</name>
		<description>SLAVE_IRQHandler</description>
		<value>2</value>
	  </interrupt>
	   <interrupt>
		<name>BB</name>
		<description>BB_IRQHandler</description>
		<value>4</value>
	  </interrupt>
	   <interrupt>
		<name>LLE</name>
		<description>LLE_IRQHandler</description>
		<value>5</value>
	  </interrupt>
	  <interrupt>
		<name>RTC</name>
		<description>RTC_IRQHandler</description>
		<value>12</value>
	  </interrupt>
	  <interrupt>
		<name>ADC</name>
		<description>ADC_IRQHandler</description>
		<value>13</value>
	  </interrupt>
	  <interrupt>
		<name>WDOG_BAT</name>
		<description>WDT_IRQHandler</description>
		<value>19</value>
	  </interrupt>
      <registers>
		<register>
			<name>R16_CLK_SYS_CFG</name>
			<description>RWA, system clock configuration, SAM</description>
			<addressOffset>0x08</addressOffset>
			<size>16</size>
			<fields>
				<field>
					<name>RB_CLK_PLL_DIV</name>
					<description>RWA, output clock divider from PLL or CK32M</description>
					<bitRange>[4:0]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_CLK_SYS_MOD</name>
					<description>RWA, system clock source mode: 00=divided from 32MHz, 01=divided from PLL-480MHz, 10=directly from 32MHz, 11=directly from 32KHz</description>
					<bitRange>[7:6]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_CLK_OSC32M_XT</name>
					<description>RWA, 32MHz clock source selection: 0=internal 32MHz oscillator, 1=external 32MHz oscillator</description>
					<bitRange>[9:9]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_XO_DI</name>
					<description>RO, X32MO input status sample value</description>
					<bitRange>[15:15]</bitRange>
					<access>read-only</access>
				</field>
			</fields>
		</register>
        <register>
			<name>R8_HFCK_PWR_CTRL</name>
			<description>RWA, high frequency clock module power control, SAM</description>
			<addressOffset>0x0A</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_CLK_XT32M_PON</name>
					<description>RWA, external 32MHz oscillator power control: 0=power down, 1-power on</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_CLK_INT32M_PON</name>
					<description>RWA, internal 32MHz oscillator power control: 0=power down, 1-power on</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_CLK_PLL_PON</name>
					<description>RWA, PLL power control: 0=power down, 1-power on</description>
					<bitRange>[4:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_SLP_CLK_OFF0</name>
			<description>RWA, sleep clock off control byte 0, SAM</description>
			<addressOffset>0x0C</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_SLP_CLK_TMR0</name>
					<description>RWA, close TMR0 clock</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_TMR1</name>
					<description>RWA, close TMR1 clock</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_TMR2</name>
					<description>RWA, close TMR2 clock</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_TMR3</name>
					<description>RWA, close TMR3 clock</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_UART0</name>
					<description>RWA, close UART0 clock</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_UART1</name>
					<description>RWA, close UART1 clock</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_UART2</name>
					<description>RWA, close UART2 clock</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_UART3</name>
					<description>RWA, close UART3 clock</description>
					<bitRange>[7:7]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_SLP_CLK_OFF1</name>
			<description>RWA, sleep clock off control byte 1, SAM</description>
			<addressOffset>0x0D</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_SLP_CLK_SPI0</name>
					<description>RWA, close SPI0 clock</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_SPI1</name>
					<description>RWA, close SPI1 clock</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_PWMX</name>
					<description>RWA, close PWMx clock</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_LCD</name>
					<description>RWA, close LCD clock</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_USB</name>
					<description>RWA, close USB clock</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_ETH</name>
					<description>RWA, close ETH clock</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_LED</name>
					<description>RWA, close LED clock</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_BLE</name>
					<description>RWA, close BLE clock</description>
					<bitRange>[7:7]</bitRange>
				</field>
			</fields>	
		</register>
		<register>
			<name>R8_SLP_WAKE_CTRL</name>
			<description>RWA, wake control, SAM</description>
			<addressOffset>0x0E</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_SLP_USB_WAKE</name>
					<description>RWA, enable USB waking</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_SLP_ETH_WAKE</name>
					<description>RWA, enable ETH waking</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_SLP_RTC_WAKE</name>
					<description>RWA, enable RTC waking</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_SLP_GPIO_WAKE</name>
					<description>RWA, enable GPIO waking</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_SLP_BAT_WAKE</name>
					<description>RWA, enable BAT waking</description>
					<bitRange>[5:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_SLP_POWER_CTRL</name>
			<description>RWA, peripherals power down control, SAM</description>
			<addressOffset>0x0F</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_SLP_ETH_PWR_DN</name>
					<description>RWA, enable ETH PHY power down</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_SLP_ROM_PWR_DN</name>
					<description>RWA, enable Flash ROM power down during halt</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_RAMX</name>
					<description>RWA, close main SRAM clock</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_SLP_CLK_RAM2K</name>
					<description>RWA, close retention 2KB SRAM clock</description>
					<bitRange>[5:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R16_PIN_ALTERNATE</name>
			<description>RW, function pin alternate configuration</description>
			<addressOffset>0x18</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_PIN_TMR0</name>
					<description>RW, TMR0 alternate pin enable: 0=TMR0/PWM0/CAP0 on PA[3], 1=TMR0_/PWM0_/CAP0_ on PB[19]</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_PIN_TMR1</name>
					<description>RW, TMR1 alternate pin enable: 0=TMR1/PWM1/CAP1 on PA[10], 1=TMR1_/PWM1_/CAP1_ on PB[10]</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_PIN_TMR2</name>
					<description>RW, TMR2 alternate pin enable: 0=TMR2/PWM2/CAP2 on PA[11], 1=TMR2_/PWM2_/CAP2_ on PB[11]</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_PIN_TMR3</name>
					<description>RW, TMR3 alternate pin enable: 0=TMR3/PWM3/CAP3 on PA[2], 1=TMR3_/PWM3_/CAP3_ on PB[18]</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_PIN_UART0</name>
					<description>RW, RXD0/TXD0 alternate pin enable: 0=RXD0/TXD0 on PB[4]/PB[7], 1=RXD0_/TXD0_ on PA[15]/PA[14]</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_PIN_UART1</name>
					<description>RW, RXD1/TXD1 alternate pin enable: 0=RXD1/TXD1 on PA[8]/PA[9], 1=RXD1_/TXD1_ on PB[8]/PB[9]</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RB_PIN_UART2</name>
					<description>RW, RXD2/TXD2 alternate pin enable: 0=RXD2/TXD2 on PA[6]/PA[7], 1=RXD2_/TXD2_ on PB[22]/PB[23]</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RB_PIN_UART3</name>
					<description>RW, RXD3/TXD3 alternate pin enable: 0=RXD3/TXD3 on PA[4]/PA[5], 1=RXD3_/TXD3_ on PB[20]/PB[21]</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RB_PIN_SPI0</name>
					<description>RW, SCS/SCK0/MOSI/MISO alternate pin enable: 0=SCS/SCK0/MOSI/MISO on PA[12]/PA[13]/PA[14]/PA[15], 1=SCS_/SCK0_/MOSI_/MISO_ on PB[12]/PB[13]/PB[14]/PB[15]</description>
					<bitRange>[8:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R16_PIN_ANALOG_IE</name>
			<description>RW, analog pin enable and digital input disable</description>
			<addressOffset>0x1A</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_PIN_SEG0_3_IE</name>
					<description>RW, LCD segment 0~3 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_PIN_SEG4_7_IE</name>
					<description>RW, LCD segment 4~7 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_PIN_SEG8_11_IE</name>
					<description>RW, LCD segment 8~11 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_PIN_SEG12_15_IE</name>
					<description>RW, LCD segment 12~15 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_PIN_SEG16_19_IE</name>
					<description>RW, LCD segment 16~19 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_PIN_SEG20_23_IE</name>
					<description>RW, LCD segment 20~23 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RB_PIN_ETH_IE</name>
					<description>RW, ETH analog I/O enable and digital input disable: 0=analog I/O disable and digital input enable, 1=analog I/O enable and digital input disable</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RB_PIN_USB_IE</name>
					<description>RW, USB analog I/O enable: 0=analog I/O disable, 1=analog I/O enable</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RB_PIN_ADC8_9_IE</name>
					<description>RW, ADC/TouchKey channel 9/8 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RB_PIN_ADC6_7_IE</name>
					<description>RW, ADC/TouchKey channel 7/6 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RB_PIN_ADC0_1_IE</name>
					<description>RW, ADC/TouchKey channel 0/1 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RB_PIN_ADC10_11_IE</name>
					<description>RW, ADC/TouchKey channel 10/11 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RB_PIN_ADC12_13_IE</name>
					<description>RW, ADC/TouchKey channel 12/13 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RB_PIN_XT32K_IE</name>
					<description>RW, external 32KHz oscillator digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RB_PIN_ADC2_3_IE</name>
					<description>RW, ADC/TouchKey channel 2/3 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>RB_PIN_ADC4_5_IE</name>
					<description>RW, ADC/TouchKey channel 4/5 digital input disable: 0=digital input enable, 1=digital input disable</description>
					<bitRange>[15:15]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_SLV_CONFIG</name>
			<description>RW, parallel slave configuration</description>
			<addressOffset>0x1C</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_SLV_ENABLE</name>
					<description>RW, parallel slave enable</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_SLV_IE_CMD</name>
					<description>RW, enable interrupt for slave writing command event</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_SLV_IE_WR</name>
					<description>RW, enable interrupt for slave writing event</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_SLV_IE_RD</name>
					<description>RW, enable interrupt for slave reading event</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_IF_SLV_CMD</name>
					<description>RO, parallel slave command synchronous flag</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
				</field>
				<field>
					<name>RB_IF_SLV_WR</name>
					<description>RW1, interrupt flag of parallel slave writing event</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RB_IF_SLV_RD</name>
					<description>RW1, interrupt flag of parallel slave reading event</description>
					<bitRange>[7:7]</bitRange>
				</field>
			</fields>
		</register>
		
		<register>
			<name>R16_POWER_PLAN</name>
			<description>RWA, power plan before sleep instruction, SAM</description>
			<addressOffset>0x20</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_PWR_RAM2K</name>
					<description>RWA, power for retention 2KB SRAM</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_PWR_CORE</name>
					<description>RWA, power retention for core and base peripherals</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_PWR_EXTEND</name>
					<description>RWA, power retention for USB and BLE</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_PWR_RAM14K</name>
					<description>RWA, power for main SRAM</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_PWR_SYS_EN</name>
					<description>RWA, power for system</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RB_PWR_MUST_1</name>
					<description>RWA, must write 1 </description>
					<bitRange>[8:8]</bitRange>
					<access>read-only</access>
				</field>
				<field>
					<name>RB_PWR_DCDC_EN</name>
					<description>RWA, DC/DC converter enable: 0=DC/DC disable and bypass, 1=DC/DC enable</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RB_PWR_DCDC_PRE</name>
					<description>RWA, DC/DC converter pre-enable</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RB_PWR_MUST_0010</name>
					<description>RWA, must write 0010</description>
					<bitRange>[14:11]</bitRange>
					<access>read-only</access>
				</field>
				<field>
					<name>RB_PWR_PLAN_EN</name>
					<description>RWA/WZ, power plan enable, auto clear after sleep executed</description>
					<bitRange>[15:15]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_AUX_POWER_ADJ</name>
			<description>RWA, aux power adjust control, SAM</description>
			<addressOffset>0x22</addressOffset>
			<size>8</size>
			<fields>
				<field>
					<name>RB_ULPLDO_ADJ</name>
					<description>RWA, Ultra-Low-Power LDO voltage adjust</description>
					<bitRange>[2:0]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>Reserved_1xx</name>
					<description>Reserved_1xx</description>
					<bitRange>[5:3]</bitRange>
					<access>read-only</access>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_BAT_DET_CTRL</name>
			<description>RWA, battery voltage detector control, SAM</description>
			<addressOffset>0x24</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_BAT_DET_EN</name>
					<description>RWA, battery voltage detector enable</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_BAT_LOWER_IE</name>
					<description>RWA, interrupt enable for battery lower voltage</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_BAT_LOW_IE</name>
					<description>RWA, interrupt enable for battery low voltage</description>
					<bitRange>[3:3]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_BAT_DET_CFG</name>
			<description>RWA, battery voltage detector configuration, SAM</description>
			<addressOffset>0x25</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_BAT_LOW_VTH</name>
					<description>RWA, select threshold voltage of battery voltage low</description>
					<bitRange>[1:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_BAT_STATUS</name>
			<description>RO, battery status</description>
			<addressOffset>0x26</addressOffset>
			<size>8</size>
			<access>read-only</access>
			<fields>
				<field>
					<name>RB_BAT_STAT_LOWER</name>
					<description>RO, battery lower voltage status, high action</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_BAT_STAT_LOW</name>
					<description>RO, battery low voltage status, high action</description>
					<bitRange>[1:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R16_INT32K_TUNE</name>
			<description>RWA, internal 32KHz oscillator tune control, SAM</description>
			<addressOffset>0x2C</addressOffset>
			<size>16</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_INT32K_TUNE</name>
					<description>RWA, internal 32KHz oscillator frequency tune</description>
					<bitRange>[9:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_XT32K_TUNE</name>
			<description>RWA, external 32KHz oscillator tune control, SAM</description>
			<addressOffset>0x2E</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_XT32K_I_TUNE</name>
					<description>RWA, external 32KHz oscillator current tune: 00=75% current, 01=standard current, 10=150% current, 11=200% current</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>RB_XT32K_C_LOAD</name>
					<description>RWA, external 32KHz oscillator load capacitor tune: Cap = RB_XT32K_C_LOAD + 12pF</description>
					<bitRange>[7:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_CK32K_CONFIG</name>
			<description>RWA, 32KHz oscillator configure</description>
			<addressOffset>0x2F</addressOffset>
			<size>8</size>
			<fields>
				<field>
					<name>RB_CLK_XT32K_PON</name>
					<description>RWA, external 32KHz oscillator power on</description>
					<bitRange>[0:0]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_CLK_INT32K_PON</name>
					<description>RWA, internal 32KHz oscillator power on</description>
					<bitRange>[1:1]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_CLK_OSC32K_XT</name>
					<description>RWA, 32KHz oscillator source selection: 0=RC, 1=XT</description>
					<bitRange>[2:2]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_32K_CLK_PIN</name>
					<description>RO, 32KHz oscillator clock pin status</description>
					<bitRange>[7:7]</bitRange>
					<access>read-only</access>
				</field>
			</fields>
		</register>
