ps2chiper/framework-ch579x/CMSIS/SVD/CH579SFR.svd
		<register>
			<name>R8_RTC_FLAG_CTRL</name>
			<description>RW, RTC flag and clear control</description>
			<addressOffset>0x30</addressOffset>
			<size>8</size>
			<fields>
				<field>
					<name>RB_RTC_TMR_CLR</name>
					<description>RW, set 1 to clear RTC timer action flag, auto clear</description>
					<bitRange>[4:4]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_RTC_TRIG_CLR</name>
					<description>RW, set 1 to clear RTC trigger action flag, auto clear</description>
					<bitRange>[5:5]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_RTC_TMR_FLAG</name>
					<description>RO, RTC timer action flag</description>
					<bitRange>[6:6]</bitRange>
					<access>read-only</access>
				</field>
				<field>
					<name>RB_RTC_TRIG_FLAG</name>
					<description>RO, RTC trigger action flag</description>
					<bitRange>[7:7]</bitRange>
					<access>read-only</access>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_RTC_MODE_CTRL</name>
			<description>RWA, RTC mode control, SAM</description>
			<addressOffset>0x31</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_RTC_TMR_MODE</name>
					<description>RWA, RTC timer mode: 000=0.125S, 001=0.25S, 010=0.5S, 011=1S, 100=2S, 101=4S, 110=8S, 111=16S</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>RB_RTC_IGNORE_B0</name>
					<description>RWA, force ignore bit0 for trigger mode: 0=compare bit0, 1=ignore bit0</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_RTC_TMR_EN</name>
					<description>RWA, RTC timer mode enable</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_RTC_TRIG_EN</name>
					<description>RWA, RTC trigger mode enable</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RB_RTC_LOAD_LO</name>
					<description>RWA, set 1 to load RTC count low word R32_RTC_CNT_32K, auto clear after loaded</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RB_RTC_LOAD_HI</name>
					<description>RWA, set 1 to load RTC count high word R32_RTC_CNT_DAY, auto clear after loaded</description>
					<bitRange>[7:7]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R32_RTC_TRIG</name>
			<description>RWA, RTC trigger value, SAM</description>
			<addressOffset>0x34</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R16_RTC_CNT_32K</name>
			<description>RO, RTC count based 32KHz</description>
			<addressOffset>0x38</addressOffset>
			<size>16</size>
			<access>read-only</access>
		</register>
		<register>
			<name>R16_RTC_CNT_2S</name>
			<description>RO, RTC count based 2 second</description>
			<addressOffset>0x3A</addressOffset>
			<size>16</size>
			<access>read-only</access>
		</register>
		<register>
			<name>R32_RTC_CNT_DAY</name>
			<description>RO, RTC count based one day, only low 14 bit</description>
			<addressOffset>0x3C</addressOffset>
			<size>32</size>
			<access>read-only</access>
		</register>
		<register>
          <name>R8_SAFE_ACCESS_SIG_RD</name>
          <description>R8_SAFE_ACCESS_SIG_RD Register safe accessing</description>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <access>read-only</access>
		  <fields>
			<field>
				<name>RB_SAFE_ACC_MODE</name>
				<description>RO, current safe accessing mode: 11=safe/unlocked (SAM), other=locked (00..01..10..11)</description>
				<bitRange>[1:0]</bitRange>
			</field>
			<field>
				<name>RB_SAFE_ACC_ACT</name>
				<description>RO, indicate safe accessing status now: 0=locked, read only, 1=safe/unlocked (SAM), write enabled</description>
				<bitRange>[3:3]</bitRange>
			</field>
			<field>
				<name>RB_SAFE_ACC_TIMER</name>
				<description>RO, safe accessing timer bit mask (16*clock number)</description>
				<bitRange>[6:4]</bitRange>
			</field>
		  </fields>
        </register>
		<register>
			<name>R8_SAFE_ACCESS_SIG_WR</name>
			<description>safe accessing sign register, must write 0x57 then 0xA8 to enter safe accessing mode</description>
			<addressOffset>0x40</addressOffset>
			<size>8</size>
			<access>write-only</access>
		</register>
		<register>
			<name>R8_CHIP_ID</name>
			<description>RF, chip ID register, always is ID_CH57*</description>
			<addressOffset>0x41</addressOffset>
			<size>8</size>
			<access>read-only</access>
		</register>
		<register>
			<name>R8_SAFE_ACCESS_ID</name>
			<description>RF, safe accessing ID register, always 0x04</description>
			<addressOffset>0x42</addressOffset>
			<size>8</size>
			<access>read-only</access>
		</register>
		<register>
			<name>R8_WDOG_COUNT</name>
			<description>RW, watch-dog count, count by clock frequency Fsys/131072</description>
			<addressOffset>0x43</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R8_RESET_STATUS</name>
			<description>RWA, reset status, SAM</description>
			<addressOffset>0x44</addressOffset>
			<size>8</size>
			<fields>
				<field>
					<name>RB_RESET_FLAG</name>
					<description>RO, recent reset flag</description>
					<bitRange>[2:0]</bitRange>
					<access>read-only</access>
				</field>
				<field>
					<name>RB_ROM_CODE_OFS</name>
					<description>RWA, code offset address selection in Flash ROM: 0=start address 0x000000, 1=start address 0x008000</description>
					<bitRange>[4:4]</bitRange>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_GLOB_CFG_INFO</name>
			<description>RO, global configuration information and status</description>
			<addressOffset>0x45</addressOffset>
			<access>read-only</access>
			<size>8</size>
			<fields>
				<field>
					<name>RB_CFG_ROM_READ</name>
					<description>RO, indicate protected status of Flash ROM code and data: 0=reading protect, 1=enable read by external programmer</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_CFG_RESET_EN</name>
					<description>RO, manual reset input enable status</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_CFG_BOOT_EN</name>
					<description>RO, boot-loader enable status</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_CFG_DEBUG_EN</name>
					<description>RO, debug enable status</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RB_BOOT_LOADER</name>
					<description>RO, indicate boot loader status: 0=application status (by software reset), 1=boot loader status</description>
					<bitRange>[5:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_RST_WDOG_CTRL</name>
			<description>RWA, reset and watch-dog control, SAM</description>
			<addressOffset>0x46</addressOffset>
			<access>read-write</access>
			<size>8</size>
			<fields>
				<field>
					<name>RB_SOFTWARE_RESET</name>
					<description>WA/WZ, global software reset, high action, auto clear</description>
					<bitRange>[0:0]</bitRange>
					<access>write-only</access>
				</field>
				<field>
					<name>RB_WDOG_RST_EN</name>
					<description>RWA, enable watch-dog reset if watch-dog timer overflow: 0=as timer only, 1=enable reset if timer overflow</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_WDOG_INT_EN</name>
					<description>RWA, watch-dog timer overflow interrupt enable: 0=disable, 1=enable</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_WDOG_INT_FLAG</name>
					<description>RW1, watch-dog timer overflow interrupt flag, cleared by RW1 or reload watch-dog count or __SEV(Send-Event)</description>
					<bitRange>[4:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_GLOB_RESET_KEEP</name>
			<description>RW, value keeper during global reset</description>
			<addressOffset>0x47</addressOffset>
			<access>read-write</access>
			<size>8</size>
		</register>
		<register>
			<name>R8_CFG_FLASH</name>
			<description>RWA, Flash ROM configure register</description>
			<addressOffset>0x4A</addressOffset>
			<access>read-write</access>
			<size>8</size>
			<fields>
				<field>
					<name>RB_CFG_FLASH_X</name>
					<description>RWA, Flash ROM configure data, keep the value unchanged if write</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RB_FLASH_BUSY_EN</name>
					<description>RWA, enable ROM busy if burst reading: 1-enable(suggest), 0-disable</description>
					<bitRange>[7:7]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_PLL_CONFIG</name>
			<description>RWA, PLL configuration control, SAM</description>
			<addressOffset>0x4B</addressOffset>
			<size>8</size>
			<fields>
				<field>
					<name>RB_PLL_CFG_DAT</name>
					<description>RWA, PLL configure data</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_PLL_LOCKED</name>
					<description>RO, indicate PLL locked</description>
					<bitRange>[7:7]</bitRange>
					<access>read-only</access>
				</field>
			</fields>
		</register>
		<register>
			<name>R16_INT32M_CALIB</name>
			<description>RWA, internal 32MHz oscillator tune control, SAM</description>
			<addressOffset>0x4C</addressOffset>
			<size>16</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R8_XT32M_TUNE</name>
			<description>RWA, external 32MHz oscillator tune control, SAM</description>
			<addressOffset>0x4E</addressOffset>
			<size>8</size>
			<fields>
				<field>
					<name>RB_XT32M_I_BIAS</name>
					<description>RWA, external 32MHz oscillator bias current tune: 00=75% current, 01=standard current, 10=125% current, 11=150% current</description>
					<bitRange>[1:0]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_XT32M_C_LOAD</name>
					<description>RWA, external 32MHz oscillator load capacitor tune: Cap = RB_XT32M_C_LOAD * 2 + 10pF</description>
					<bitRange>[6:4]</bitRange>
					<access>read-write</access>
				</field>
			</fields>
		</register>
		<register>
			<name>R16_OSC_CAL_CNT</name>
			<description>RO, system clock count value for 32KHz 5 cycles</description>
			<addressOffset>0x50</addressOffset>
			<size>16</size>
			<access>read-only</access>
			<fields>
				<field>
					<name>RB_OSC_CAL_CNT</name>
					<description>RO, system clock count value for 32KHz 5 cycles</description>
					<bitRange>[11:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_OSC_CAL_CTRL</name>
			<description>RWA, oscillator frequency calibration control, SAM</description>
			<addressOffset>0x52</addressOffset>
			<size>8</size>
			<fields>
				<field>
					<name>RB_OSC_CNT_EN</name>
					<description>RWA, calibration counter enable</description>
					<bitRange>[0:0]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_OSC_CNT_HALT</name>
					<description>RO, calibration counter halt status: 0=counting, 1=halt for reading count value</description>
					<bitRange>[1:1]</bitRange>
					<access>read-only</access>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_ADC_CHANNEL</name>
			<description>RW, ADC input channel selection</description>
			<addressOffset>0x58</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_ADC_CH_INX</name>
					<description>RW, ADC input channel index</description>
					<bitRange>[3:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_ADC_CFG</name>
			<description>RW, ADC configure</description>
			<addressOffset>0x59</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_ADC_POWER_ON</name>
					<description>RW, ADC power control: 0=power down, 1=power on</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RB_ADC_BUF_EN</name>
					<description>RW, ADC input buffer enable</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RB_ADC_DIFF_EN</name>
					<description>RW, ADC input channel mode: 0=single-end, 1=differnetial</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RB_ADC_OFS_TEST</name>
					<description>RW, enable ADC offset test mode: 0=normal mode, 1=short port4 to test offset</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RB_ADC_PGA_GAIN</name>
					<description>RW, set ADC input PGA gain: 00=-12dB, 01=-6dB, 10=0dB, 11=6dB</description>
					<bitRange>[5:4]</bitRange>
				</field>
				<field>
					<name>RB_ADC_CLK_DIV</name>
					<description>RW, select ADC clock frequency: 00=3.2MHz, 01=2.67MHz, 10=5.33MHz, 11=4MHz</description>
					<bitRange>[7:6]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_ADC_CONVERT</name>
			<description>RW, ADC convert control</description>
			<addressOffset>0x5A</addressOffset>
			<size>8</size>
			<fields>
				<field>
					<name>RB_ADC_START</name>
					<description>RW, ADC convert start control: 0=stop ADC convert, 1=start an ADC convert, auto clear</description>
					<bitRange>[0:0]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_TKEY_PWR_ON</name>
					<description>RW, Touchkey power on: 0=power down, 1=power on</description>
					<bitRange>[3:3]</bitRange>
					<access>read-write</access>
				</field>
				<field>
					<name>RB_TKEY_ACTION</name>
					<description>RO, Touchkey action status: 0=free, 1=discharge or charge or ADC</description>
					<bitRange>[4:4]</bitRange>
					<access>read-only</access>
				</field>
				<field>
					<name>RB_TKEY_CHG_ACT</name>
					<description>RO, Touchkey capacity charge status: 0=free, 1=charge</description>
					<bitRange>[5:5]</bitRange>
					<access>read-only</access>
				</field>
				<field>
					<name>RB_ADC_EOC_X</name>
					<description>RO, end of ADC conversion flag</description>
					<bitRange>[7:7]</bitRange>
					<access>read-only</access>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_TEM_SENSOR</name>
			<description>RW, temperature sensor control</description>
			<addressOffset>0x5B</addressOffset>
			<size>8</size>
			<access>read-write</access>
			<fields>
				<field>
					<name>RB_TEM_SEN_CALIB</name>
					<description>RW, temperature sensor calibration</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>RB_TEM_SEN_PWR_ON</name>
					<description>RW, temperature sensor power control: 0=power down, 1=power on</description>
					<bitRange>[7:7]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R16_ADC_DATA</name>
			<description>RO, ADC data</description>
			<addressOffset>0x5C</addressOffset>
			<size>16</size>
			<access>read-only</access>
			<fields>
				<field>
					<name>RB_ADC_DATA</name>
					<description>RO, ADC conversion data</description>
					<bitRange>[11:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>R8_ADC_INT_FLAG</name>
			<description>RO, ADC interrupt flag register</description>
			<addressOffset>0x5E</addressOffset>
			<size>8</size>
			<access>read-only</access>
			<fields>
				<field>
					<name>RB_ADC_IF_EOC</name>
					<description>RO, ADC conversion interrupt flag: 0=free or converting, 1=end of conversion, interrupt action, write R8_ADC_CONVERT to clear flag</description>
					<bitRange>[7:7]</bitRange>
				</field>		
			</fields>
		</register>
		<register>
			<name>R8_TKEY_CNT</name>
			<description>WO, Touch-key charge and discharge count</description>
			<addressOffset>0x5F</addressOffset>
			<size>8</size>
			<access>write-only</access>
		</register>
		
		<register>
			<name>R16_PA_INT_EN</name>
			<description>RW, GPIO PA interrupt enable</description>
			<addressOffset>0x90</addressOffset>
			<size>16</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R16_PB_INT_EN</name>
			<description>RW, GPIO PB interrupt enable</description>
			<addressOffset>0x92</addressOffset>
			<size>16</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R16_PA_INT_MODE</name>
			<description>RW, GPIO PA interrupt mode: 0=level action, 1=edge action</description>
			<addressOffset>0x94</addressOffset>
			<size>16</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R16_PB_INT_MODE__R8_SLV_RD_STAT</name>
			<description>RW, GPIO PB interrupt mode: 0=level action, 1=edge action;RW, status for parallel slave read</description>
			<addressOffset>0x96</addressOffset>
			<size>16</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R8_SLV_WR_DATA</name>
			<description>RW, data or command from parallel slave write</description>
			<addressOffset>0x97</addressOffset>
			<size>8</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R16_PA_INT_IF</name>
			<description>RW1, GPIO PA interrupt flag</description>
			<addressOffset>0x9C</addressOffset>
			<size>16</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R16_PB_INT_IF</name>
			<description>RW1, GPIO PB interrupt flag</description>
			<addressOffset>0x9E</addressOffset>
			<size>16</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PA_DIR</name>
			<description>RW, GPIO PA I/O direction: 0=in, 1=out</description>
			<size>32</size>
			<addressOffset>0xA0</addressOffset>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PA_PIN</name>
			<description>RO, GPIO PA input</description>
			<addressOffset>0xA4</addressOffset>
			<size>32</size>
			<access>read-only</access>
		</register>
		<register>
			<name>R32_PA_OUT</name>
			<description>RW, GPIO PA output</description>
			<addressOffset>0xA8</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PA_CLR</name>
			<description>WZ, GPIO PA clear output: 0=keep, 1=clear</description>
			<addressOffset>0xAC</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PA_PU</name>
			<description>RW, GPIO PA pullup resistance enable</description>
			<addressOffset>0xB0</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PA_PD_DRV</name>
			<description>RW, PA pulldown for input or PA driving capability for output</description>
			<addressOffset>0xB4</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PB_DIR</name>
			<description>RW, GPIO PB I/O direction: 0=in, 1=out</description>
			<addressOffset>0xC0</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PB_PIN</name>
			<description>RO, GPIO PB input</description>
			<addressOffset>0xC4</addressOffset>
			<size>32</size>
			<access>read-only</access>
		</register>
		<register>
			<name>R32_PB_OUT__R8_SLV_RD_DATA</name>
			<description>RW, GPIO PB output;RW, data for parallel slave read</description>
			<addressOffset>0xC8</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PB_CLR</name>
			<description>WZ, GPIO PB clear output: 0=keep, 1=clear</description>
			<addressOffset>0xCC</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PB_PU</name>
			<description>RW, GPIO PB pullup resistance enable</description>
			<addressOffset>0xD0</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
		<register>
			<name>R32_PB_PD_DRV</name>
			<description>RW, PB pulldown for input or PB driving capability for output</description>
			<addressOffset>0xD4</addressOffset>
			<size>32</size>
			<access>read-write</access>
		</register>
