ps2chiper/framework-ch579x/CMSIS/SVD/CH579SFR.svd
	 </registers> 
	</peripheral>
	<peripheral>
		<name>FLASH</name>
		<description>Flash ROM control register</description>
		<groupName>Flash</groupName>
		<baseAddress>0x40001800</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<registers>
			<register>
				<name>R32_FLASH_DATA</name>
				<description>RW, Flash ROM data</description>
				<addressOffset>0x00</addressOffset>
				<size>32</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R32_FLASH_ADDR</name>
				<description>RW, Flash ROM address</description>
				<addressOffset>0x04</addressOffset>
				<size>32</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_FLASH_COMMAND</name>
				<description>WO, Flash ROM operation command</description>
				<addressOffset>0x08</addressOffset>
				<size>8</size>
				<access>write-only</access>
			</register>
			<register>
				<name>R8_FLASH_PROTECT</name>
				<description>RW, Flash ROM protect control</description>
				<addressOffset>0x09</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ROM_WE_MUST_10</name>
						<description>RW, must write 10</description>
						<access>write-only</access>
						<bitRange>[7:6]</bitRange>
					</field>
					<field>
						<name>RB_ROM_DATA_WE</name>
						<description>RW, enable Flash ROM data area being erase/write: 0=writing protect, 1=enable program and erase</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_ROM_CODE_WE</name>
						<description>RW, enable Flash ROM code area being erase/write: 0=writing protect, 1=enable program and erase</description>
						<bitRange>[3:3]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_FLASH_STATUS</name>
				<description>RO, Flash ROM operation status</description>
				<addressOffset>0x0A</addressOffset>
				<size>16</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>RB_ROM_CMD_TOUT</name>
						<description>RO, Flash ROM operation result: 0=success, 1=operation time out</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_ROM_CMD_ERR</name>
						<description>RO, Flash ROM operation command error flag: 0=command accepted, 1=unknown command</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_ROM_ADDR_OK</name>
						<description>RO, Flash ROM erase/write operation address valid flag, can be reviewed before or after operation: 0=invalid parameter, 1=address valid</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_ROM_READ_FREE</name>
						<description>RO, indicate protected status of Flash ROM code and data: 0=reading protect, 1=enable read by external programmer</description>
						<bitRange>[8:8]</bitRange>
					</field>
				</fields>
			</register>
		</registers>
	</peripheral>
	<peripheral>
		<name>TMR0</name>
		<description>Timer0 register</description>
		<groupName>TMR</groupName>
		<baseAddress>0x40002000</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>TMR0</name>
			<description>TMR0_IRQHandler</description>
			<value>0</value>
		</interrupt>
		<registers>
			<register>
				<name>R8_TMR0_CTRL_MOD</name>
				<description>RW, TMR0 mode control</description>
				<addressOffset>0x00</addressOffset>
				<access>read-write</access>
				<size>8</size>
				<fields>
					<field>
						<name>RB_TMR_MODE_IN</name>
						<description>RW, timer in mode: 0=timer/PWM, 1=capture/count</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_TMR_ALL_CLEAR</name>
						<description>RW, force clear timer FIFO and count</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_TMR_COUNT_EN</name>
						<description>RW, timer count enable</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_TMR_OUT_EN</name>
						<description>RW, timer output enable</description>
						<bitRange>[3:3]</bitRange>				
					</field>
					<field>
						<name>RB_TMR_OUT_POLAR_COUNT</name>
						<description>RW, timer PWM output polarity: 0=default low and high action, 1=default high and low action;RW, count sub-mode if RB_TMR_MODE_IN=1: 0=capture, 1=count</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_TMR_PWM_REPEAT_EDGE</name>
						<description>RW, timer PWM repeat mode: 00=1, 01=4, 10=8, 11-16;RW, timer capture edge mode: 00=disable, 01=edge change, 10=fall to fall, 11-rise to rise</description>
						<bitRange>[7:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_TMR0_INTER_EN</name>
				<description>RW, TMR0 interrupt enable</description>
				<addressOffset>0x02</addressOffset>
				<access>read-write</access>
				<size>8</size>
				<fields>
					<field>
						<name>RB_TMR_IE_CYC_END</name>
						<description>RW, enable interrupt for timer capture count timeout or PWM cycle end</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_TMR_IE_DATA_ACT</name>
						<description>RW, enable interrupt for timer capture input action or PWM trigger</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_TMR_IE_FIFO_HF</name>
						<description>RW, enable interrupt for timer FIFO half (capture fifo >=4 or PWM fifo less than 3)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_TMR_IE_DMA_END</name>
						<description>RW, enable interrupt for timer1/2 DMA completion</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_TMR_IE_FIFO_OV</name>
						<description>RW, enable interrupt for timer FIFO overflow</description>
						<bitRange>[4:4]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_TMR0_INT_FLAG</name>
				<description>RW1, TMR0 interrupt flag</description>
				<addressOffset>0x06</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_TMR_IF_CYC_END</name>
						<description>RW1, interrupt flag for timer capture count timeout or PWM cycle end</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_TMR_IF_DATA_ACT</name>
						<description>RW1, interrupt flag for timer capture input action or PWM trigger</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_TMR_IF_FIFO_HF</name>
						<description>RW1, interrupt flag for timer FIFO half (capture fifo >=4 or PWM fifo less than 3 </description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_TMR_IF_DMA_END</name>
						<description>RW1, interrupt flag for timer1/2 DMA completion</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_TMR_IF_FIFO_OV</name>
						<description>RW1, interrupt flag for timer FIFO overflow</description>
						<bitRange>[4:4]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_TMR0_FIFO_COUNT</name>
				<description>RO, TMR0 FIFO count status</description>
				<addressOffset>0x07</addressOffset>
				<size>8</size>
				<access>read-only</access>
			</register>
			<register>
				<name>R32_TMR0_COUNT</name>
				<description>RO, TMR0 current count</description>
				<addressOffset>0x08</addressOffset>
				<size>32</size>
				<access>read-only</access>
			</register>
			<register>
				<name>R32_TMR0_CNT_END</name>
				<description>RW, TMR0 end count value, only low 26 bit</description>
				<addressOffset>0x0C</addressOffset>
				<size>32</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R32_TMR0_FIFO_RO</name>
				<description>RO, TMR0 FIFO register, only low 26 bit</description>
				<addressOffset>0x10</addressOffset>
				<size>32</size>
				<access>read-only</access>
			</register>
			<register>
				<name>R32_TMR0_FIFO_WO</name>
				<description>WO, TMR0 FIFO register, only low 26 bit</description>
				<addressOffset>0x10</addressOffset>
				<size>32</size>
				<access>write-only</access>
			</register>
