ps2chiper/framework-ch579x/CMSIS/SVD/CH579SFR.svd
		</registers>
	</peripheral>
	<peripheral>
		<name>PWMx</name>
		<description>PWMx register</description>
		<groupName>PWMx</groupName>
		<baseAddress>0x40005000</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<registers>
			<register>
				<name>R8_PWM_OUT_EN</name>
				<description>RW, PWM output enable control</description>
				<addressOffset>0x00</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_PWM4_OUT_EN</name>
						<description>RW, PWM4 output enable</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_PWM5_OUT_EN</name>
						<description>RW, PWM5 output enable</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_PWM6_OUT_EN</name>
						<description>RW, PWM6 output enable</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_PWM7_OUT_EN</name>
						<description>RW, PWM7 output enable</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_PWM8_OUT_EN</name>
						<description>RW, PWM8 output enable</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_PWM9_OUT_EN</name>
						<description>RW, PWM9 output enable</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_PWM10_OUT_EN</name>
						<description>RW, PWM10 output enable</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_PWM11_OUT_EN</name>
						<description>RW, PWM11 output enable</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_PWM_POLAR</name>
				<description>RW, PWM output polarity control</description>
				<addressOffset>0x01</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_PWM4_POLAR</name>
						<description>RW, PWM4 output polarity: 0=default low and high action, 1=default high and low action</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_PWM5_POLAR</name>
						<description>RW, PWM5 output polarity: 0=default low and high action, 1=default high and low action</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_PWM6_POLAR</name>
						<description>RW, PWM6 output polarity: 0=default low and high action, 1=default high and low action</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_PWM7_POLAR</name>
						<description>RW, PWM7 output polarity: 0=default low and high action, 1=default high and low action</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_PWM8_POLAR</name>
						<description>RW, PWM8 output polarity: 0=default low and high action, 1=default high and low action</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_PWM9_POLAR</name>
						<description>RW, PWM9 output polarity: 0=default low and high action, 1=default high and low action</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_PWM10_POLAR</name>
						<description>RW, PWM10 output polarity: 0=default low and high action, 1=default high and low action</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_PWM11_POLAR</name>
						<description>RW, PWM11 output polarity: 0=default low and high action, 1=default high and low action</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_PWM_CONFIG</name>
				<description>RW, PWM configuration</description>
				<addressOffset>0x02</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_PWM_CYCLE_SEL</name>
						<description>RW, PWM cycle selection: 0=256/128/64/32 clocks, 1=255/127/63/31 clocks</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_PWM_STAG_ST</name>
						<description>RO, PWM stagger cycle status</description>
						<bitRange>[1:1]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_PWM_CYC_MOD</name>
						<description>RW, PWM data width mode: 00=8 bits data, 01=7 bits data, 10=6 bits data, 11=5 bits data</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_PWM4_5_STAG_EN</name>
						<description>RW, PWM4/5 stagger output enable: 0=independent output, 1=stagger output</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_PWM6_7_STAG_EN</name>
						<description>RW, PWM6/7 stagger output enable: 0=independent output, 1=stagger output</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_PWM8_9_STAG_EN</name>
						<description>RW, PWM8/9 stagger output enable: 0=independent output, 1=stagger output</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_PWM10_11_STAG_EN</name>
						<description>RW, PWM10/11 stagger output enable: 0=independent output, 1=stagger output</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_PWM_CLOCK_DIV</name>
				<description>RW, PWM clock divisor</description>
				<addressOffset>0x03</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_PWM4_DATA</name>
				<description>RW, PWM4 data holding</description>
				<addressOffset>0x04</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_PWM5_DATA</name>
				<description>RW, PWM5 data holding</description>
				<addressOffset>0x05</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_PWM6_DATA</name>
				<description>RW, PWM6 data holding</description>
				<addressOffset>0x06</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_PWM7_DATA</name>
				<description>RW, PWM7 data holding</description>
				<addressOffset>0x07</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_PWM8_DATA</name>
				<description>RW, PWM8 data holding</description>
				<addressOffset>0x08</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_PWM9_DATA</name>
				<description>RW, PWM9 data holding</description>
				<addressOffset>0x09</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_PWM10_DATA</name>
				<description>RW, PWM10 data holding</description>
				<addressOffset>0x0A</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_PWM11_DATA</name>
				<description>RW, PWM11 data holding</description>
				<addressOffset>0x0B</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
