ps2chiper/framework-ch579x/CMSIS/SVD/CH579SFR.svd
		</registers>
	</peripheral>
	<peripheral>
		<name>LCD</name>
		<description>LCD register</description>
		<groupName>LCD</groupName>
		<baseAddress>0x40006000</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<registers>
			<register>
				<name>R8_LCD_CTRL_MOD</name>
				<description>R8_LCD_CTRL_MOD</description>
				<addressOffset>0x00</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_SYS_POWER_ON</name>
						<description>RW, LCD digital system enable</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_LCD_POWER_ON</name>
						<description>RW, LCD analog system enable</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_LCD_BIAS</name>
						<description>RW, LCD bias select:  0=1/2 bias,  1=1/3 bias</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_LCD_DUTY</name>
						<description>RW, LCD duty select:  00=1/2 duty,  01=1/3 duty,  10=1/4 duty</description>
						<bitRange>[4:3]</bitRange>
					</field>
					<field>
						<name>RB_LCD_SCAN_CLK</name>
						<description>RW, LCD scan clock select: 00=256Hz, 01=512Hz, 10=1KHz, 11=128Hz</description>
						<bitRange>[6:5]</bitRange>
					</field>
					<field>
						<name>RB_LCD_V_SEL</name>
						<description>RW, LCD drive voltage:0=VIO33*100%(3.3V),1=VIO33*76%(2.5V)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R32_LCD_RAM0</name>
				<description>RW, LCD driver data0, address 0-3</description>
				<addressOffset>0x04</addressOffset>
				<size>32</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R32_LCD_RAM1</name>
				<description>RW, LCD driver data1, address 4-7</description>
				<addressOffset>0x08</addressOffset>
				<size>32</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R32_LCD_RAM2</name>
				<description>RW, LCD driver data2, address 8-12</description>
				<addressOffset>0x0C</addressOffset>
				<size>32</size>
				<access>read-write</access>
			</register>
		</registers>
	</peripheral>
	<peripheral>
		<name>LED</name>
		<description>LED register</description>
		<groupName>LED</groupName>
		<baseAddress>0x40006400</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>LED</name>
			<description>LED_IRQHandler</description>
			<value>15</value>
		</interrupt>
		<registers>
			<register>
				<name>R8_LED_CTRL_MOD</name>
				<description>RW, LED mode control</description>
				<addressOffset>0x00</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_LED_BIT_ORDER</name>
						<description>RW, LED bit data order: 0=LSB first, 1=MSB first</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_LED_ALL_CLEAR</name>
						<description>RW, force clear LED FIFO and count</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_LED_OUT_POLAR</name>
						<description>RW, LED output polarity: 0=pass, 1=invert</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_LED_OUT_EN</name>
						<description>RW, LED output enable</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_LED_DMA_EN</name>
						<description>RW, LED DMA enable and DMA interrupt enable</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_LED_IE_FIFO</name>
						<description>RW, enable interrupt for LED FIFO less than 2</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_LED_CHAN_MOD</name>
						<description>RW, LED channel mode: 00=LED0, 01=LED0/1, 10=LED0~3, 11=LED0~3 and LED2/3 from auxiliary buffer</description>
						<bitRange>[7:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_LED_CLOCK_DIV</name>
				<description>RW, LED serial clock divisor</description>
				<addressOffset>0x01</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_LED_STATUS</name>
				<description>RO, LED status</description>
				<addressOffset>0x04</addressOffset>
				<size>8</size>
				<fields>
					<field>
						<name>RB_LED_FIFO_COUNT</name>
						<description>RO, LED FIFO byte count status, must divided by 2 for width half-word</description>
						<bitRange>[2:0]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_LED_CLOCK</name>
						<description>RO, current LED clock level</description>
						<bitRange>[4:4]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_LED_IF_FIFO</name>
						<description>RW1, interrupt flag for LED FIFO less than 2, cleared by RW1 or write R32/R16_LED_FIFO</description>
						<bitRange>[5:5]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_LED_FIFO_EMPTY</name>
						<description>RO: indicate FIFO empty status</description>
						<bitRange>[6:6]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_LED_IF_DMA_END</name>
						<description>RW1, interrupt flag for LED DMA completion, cleared by RW1 or write R32/R16_LED_DMA_CNT</description>
						<bitRange>[7:7]</bitRange>
						<access>read-write</access>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_LED_FIFO</name>
				<description>WO, LED FIFO register, width is half-word</description>
				<addressOffset>0x08</addressOffset>
				<size>16</size>
				<access>write-only</access>
			</register>
			<register>
				<name>R16_LED_DMA_CNT</name>
				<description>RW, LED DMA main buffer remainder half-word count, exclude auxiliary buffer, automatic decreasing after DMA, only low 12 bit</description>
				<addressOffset>0x10</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_LED_DMA_MAIN</name>
				<description>RW, LED main buffer DMA begin and current address, automatic increasing after DMA</description>
				<addressOffset>0x14</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_LED_DMA_AUX</name>
				<description>RW, LED auxiliary buffer DMA begin and current address, automatic increasing after DMA</description>
				<addressOffset>0x18</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
