ps2chiper/framework-ch579x/CMSIS/SVD/CH579SFR.svd
		</registers>
	</peripheral>
	<peripheral>
		<name>USB</name>
		<description>USB register</description>
		<groupName>USB</groupName>
		<baseAddress>0x40008000</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>USB</name>
			<description>USB_IRQHandler</description>
			<value>6</value>
		</interrupt>
		<registers>
			<register>
				<name>R8_USB_CTRL</name>
				<description>USB base control</description>
				<addressOffset>0x00</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UC_DMA_EN</name>
						<description>DMA enable and DMA interrupt enable for USB</description>
						<bitRange>[0:0]</bitRange>		
					</field>
					<field>
						<name>RB_UC_CLR_ALL</name>
						<description>force clear FIFO and count of USB</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UC_RESET_SIE</name>
						<description>force reset USB SIE, need software clear</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UC_INT_BUSY</name>
						<description>enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>MASK_UC_SYS_CTRL</name>
						<description>bit mask of USB system control</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>RB_UC_LOW_SPEED</name>
						<description>enable USB low speed: 0=12Mbps, 1=1.5Mbps</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UC_HOST_MODE</name>
						<description>enable USB host mode: 0=device mode, 1=host mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UDEV_CTRL__R8_UHOST_CTRL</name>
				<description>USB device physical prot control</description>
				<addressOffset>0x01</addressOffset>
				<size>8</size>
				<fields>
					<field>
						<name>RB_UD_PORT_EN__RB_UH_PORT_EN</name>
						<description>enable USB physical port I/O: 0=disable, 1=enable;enable USB port: 0=disable, 1=enable port, automatic disabled if USB device detached</description>
						<bitRange>[0:0]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_UD_GP_BIT__RB_UH_BUS_RESET</name>
						<description>general purpose bit;control USB bus reset: 0=normal, 1=force bus reset</description>
						<bitRange>[1:1]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_UD_LOW_SPEED__RB_UH_LOW_SPEED</name>
						<description>enable USB physical port low speed: 0=full speed, 1=low speed;enable USB port low speed: 0=full speed, 1=low speed</description>
						<bitRange>[2:2]</bitRange>
						<access>read-write</access>
					</field>
					<field>
						<name>RB_UD_DM_PIN__RB_UH_DM_PIN</name>
						<description>ReadOnly: indicate current UDM pin level</description>
						<bitRange>[4:4]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_UD_DP_PIN__RB_UH_DP_PIN</name>
						<description>ReadOnly: indicate current UDP pin level</description>
						<bitRange>[5:5]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_UD_PD_DIS__RB_UH_PD_DIS</name>
						<description>disable USB UDP/UDM pulldown resistance: 0=enable pulldown, 1=disable</description>
						<bitRange>[7:7]</bitRange>
						<access>read-only</access>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_INT_EN</name>
				<description>USB interrupt enable</description>
				<addressOffset>0x02</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UIE_BUS_RST__RB_UIE_DETECT</name>
						<description>enable interrupt for USB bus reset event for USB device mode;enable interrupt for USB device detected event for USB host mode</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UIE_TRANSFER</name>
						<description>enable interrupt for USB transfer completion</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UIE_SUSPEND</name>
						<description>enable interrupt for USB suspend or resume event</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UIE_HST_SOF</name>
						<description>enable interrupt for host SOF timer action for USB host mode</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UIE_FIFO_OV</name>
						<description>enable interrupt for FIFO overflow</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UIE_DEV_NAK</name>
						<description>enable interrupt for NAK responded for USB device mode</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UIE_DEV_SOF</name>
						<description>enable interrupt for SOF received for USB device mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_DEV_AD</name>
				<description>USB device address</description>
				<addressOffset>0x03</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_USB_ADDR</name>
						<description>bit mask for USB device address</description>
						<bitRange>[6:0]</bitRange>
					</field>
					<field>
						<name>RB_UDA_GP_BIT</name>
						<description>general purpose bit</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_MIS_ST</name>
				<description>USB miscellaneous status</description>
				<addressOffset>0x05</addressOffset>
				<size>8</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>RB_UMS_DEV_ATTACH</name>
						<description>RO, indicate device attached status on USB host</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UMS_DM_LEVEL</name>
						<description>RO, indicate UDM level saved at device attached to USB host</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SUSPEND</name>
						<description>RO, indicate USB suspend status</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UMS_BUS_RESET</name>
						<description>RO, indicate USB bus reset status</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UMS_R_FIFO_RDY</name>
						<description>RO, indicate USB receiving FIFO ready status (not empty)</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SIE_FREE</name>
						<description>RO, indicate USB SIE free status</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_ACT</name>
						<description>RO, indicate host SOF timer action status for USB host</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UMS_SOF_PRES</name>
						<description>RO, indicate host SOF timer presage status</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_INT_FG</name>
				<description>USB interrupt flag</description>
				<addressOffset>0x06</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UIF_BUS_RST__RB_UIF_DETECT</name>
						<description>bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear;device detected event interrupt flag for USB host mode, direct bit address clear or write 1 to clear</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UIF_TRANSFER</name>
						<description>USB transfer completion interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_UIF_SUSPEND</name>
						<description>USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UIF_HST_SOF</name>
						<description>host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UIF_FIFO_OV</name>
						<description>FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_U_SIE_FREE</name>
						<description>RO, indicate USB SIE free status</description>
						<bitRange>[5:5]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_U_TOG_OK</name>
						<description>RO, indicate current USB transfer toggle is OK</description>
						<bitRange>[6:6]</bitRange>
						<access>read-only</access>
					</field>
					<field>
						<name>RB_U_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received</description>
						<bitRange>[7:7]</bitRange>
						<access>read-only</access>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_INT_ST</name>
				<description>USB interrupt status</description>
				<addressOffset>0x07</addressOffset>
				<size>8</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>MASK_UIS_H_RES__MASK_UIS_ENDP</name>
						<description>RO, bit mask of current transfer handshake response for USB host mode: 0000=no response, time out from device, others=handshake response PID received;RO, bit mask of current transfer endpoint number for USB device mode</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MASK_UIS_TOKEN</name>
						<description>RO, bit mask of current token PID code received for USB device mode</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>RB_UIS_TOG_OK</name>
						<description>RO, indicate current USB transfer toggle is OK</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UIS_IS_NAK</name>
						<description>RO, indicate current USB transfer is NAK received for USB device mode</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_RX_LEN</name>
				<description>USB receiving length</description>
				<addressOffset>0x08</addressOffset>
				<size>8</size>
				<access>read-only</access>
			</register>
			<register>
				<name>R8_UEP4_1_MOD</name>
				<description>endpoint 4/1 mode</description>
				<addressOffset>0x0C</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UEP4_TX_EN</name>
						<description>enable USB endpoint 4 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP4_RX_EN</name>
						<description>enable USB endpoint 4 receiving (OUT)</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_BUF_MOD</name>
						<description>buffer mode of USB endpoint 1</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_TX_EN</name>
						<description>enable USB endpoint 1 transmittal (IN)</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP1_RX_EN</name>
						<description>enable USB endpoint 1 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP2_3_MOD__R8_UH_EP_MOD</name>
				<description>endpoint 2/3 mode;host endpoint mode</description>
				<addressOffset>0x0D</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UEP2_BUF_MOD__RB_UH_EP_RBUF_MOD</name>
						<description>buffer mode of USB endpoint 2;buffer mode of USB host IN endpoint</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_TX_EN</name>
						<description>enable USB endpoint 2 transmittal (IN)</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP2_RX_EN__RB_UH_EP_RX_EN</name>
						<description>enable USB endpoint 2 receiving (OUT);enable USB host IN endpoint receiving</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_BUF_MOD__RB_UH_EP_TBUF_MOD</name>
						<description>buffer mode of USB endpoint 3;buffer mode of USB host OUT endpoint</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_TX_EN__RB_UH_EP_TX_EN</name>
						<description>enable USB endpoint 3 transmittal (IN);enable USB host OUT endpoint transmittal</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP3_RX_EN</name>
						<description>enable USB endpoint 3 receiving (OUT)</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_UEP0_DMA</name>
				<description>endpoint 0 DMA buffer address</description>
				<addressOffset>0x10</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_UEP1_DMA</name>
				<description>endpoint 1 DMA buffer address</description>
				<addressOffset>0x14</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_UEP2_DMA__R16_UH_RX_DMA</name>
				<description>endpoint 2 DMA buffer address;host rx endpoint buffer high address</description>
				<addressOffset>0x18</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_UEP3_DMA__R16_UH_TX_DMA</name>
				<description>endpoint 3 DMA buffer address;host tx endpoint buffer high address</description>
				<addressOffset>0x1C</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP0_T_LEN</name>
				<description>endpoint 0 transmittal length</description>
				<addressOffset>0x20</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP0_CTRL</name>
				<description>endpoint 0 control</description>
				<addressOffset>0x22</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP1_T_LEN</name>
				<description>endpoint 1 transmittal length</description>
				<addressOffset>0x24</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP1_CTRL__R8_UH_SETUP</name>
				<description>endpoint 1 control;host aux setup</description>
				<addressOffset>0x26</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG__RB_UH_SOF_EN</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1;USB host automatic SOF enable</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG__RB_UH_PRE_PID_EN</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;RB_UH_PRE_PID_EN;USB host PRE PID enable for low speed device via hub</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP2_T_LEN__R8_UH_EP_PID</name>
				<description>endpoint 2 transmittal length;host endpoint and PID</description>
				<addressOffset>0x28</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UH_ENDP</name>
						<description>bit mask of endpoint number for USB host transfer</description>
						<bitRange>[3:0]</bitRange>
					</field>
					<field>
						<name>MASK_UH_TOKEN</name>
						<description>bit mask of token PID for USB host transfer</description>
						<bitRange>[7:4]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP2_CTRL__R8_UH_RX_CTRL</name>
				<description>endpoint 2 control;host receiver endpoint control</description>
				<addressOffset>0x2A</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG__RB_UH_R_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle;enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG__RB_UH_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP3_T_LEN__R8_UH_TX_LEN</name>
				<description>endpoint 3 transmittal length;host transmittal endpoint transmittal length</description>
				<addressOffset>0x2C</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP3_CTRL__R8_UH_TX_CTRL</name>
				<description>endpoint 3 control;host transmittal endpoint control</description>
				<addressOffset>0x2E</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_UEP4_T_LEN</name>
				<description>endpoint 4 transmittal length</description>
				<addressOffset>0x30</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_UEP4_CTRL</name>
				<description>endpoint 4 control</description>
				<addressOffset>0x32</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>MASK_UEP_T_RES</name>
						<description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>MASK_UEP_R_RES</name>
						<description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
						<bitRange>[3:2]</bitRange>
					</field>
					<field>
						<name>RB_UEP_AUTO_TOG</name>
						<description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_UEP_T_TOG</name>
						<description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UEP_R_TOG</name>
						<description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_USB_TYPE_C_CTRL</name>
				<description>USB type-C control</description>
				<addressOffset>0x38</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_UCC1_PU_EN</name>
						<description>USB CC1 pullup resistance control</description>
						<bitRange>[1:0]</bitRange>
					</field>
					<field>
						<name>RB_UCC1_PD_EN</name>
						<description>USB CC1 5.1K pulldown resistance: 0=disable, 1=enable pulldown</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_VBUS_PD_EN</name>
						<description>USB VBUS 10K pulldown resistance: 0=disable, 1=enable pullup</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_UCC2_PU_EN</name>
						<description>USB CC2 pullup resistance control</description>
						<bitRange>[5:4]</bitRange>
					</field>
					<field>
						<name>RB_UCC2_PD_EN</name>
						<description>USB CC2 5.1K pulldown resistance: 0=disable, 1=enable pulldown</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_UTCC_GP_BIT</name>
						<description>USB general purpose bit</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
