ps2chiper/framework-ch579x/CMSIS/SVD/CH579SFR.svd
		</registers>
	</peripheral>
	<peripheral>
		<name>ETH</name>
		<description>ETH register</description>
		<groupName>ETH</groupName>
		<baseAddress>0x40009000</baseAddress>
		<addressBlock>
			<offset>0x00</offset>
			<size>0x400</size>
			<usage>registers</usage>
		</addressBlock>
		<interrupt>
			<name>ETH</name>
			<description>ETH_IRQHandler</description>
			<value>7</value>
		</interrupt>
		<registers>
			<register>
				<name>R8_ETH_EIE</name>
				<description>soso</description>
				<addressOffset>0x03</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_EIE_RXERIE</name>
						<description>soso</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIE_TXERIE</name>
						<description>soso</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIE_R_EN50</name>
						<description>soso</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIE_TXIE</name>
						<description>soso</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIE_LINKIE</name>
						<description>soso</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIE_RXIE</name>
						<description>soso</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIE_INTIE</name>
						<description>soso</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_ETH_EIR</name>
				<description>soso</description>
				<addressOffset>0x04</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_EIR_RXERIF</name>
						<description>soso</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIR_TXERIF</name>
						<description>soso</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIR_TXIF</name>
						<description>soso</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIR_LINKIF</name>
						<description>soso</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_ETH_EIR_RXIF</name>
						<description>soso</description>
						<bitRange>[6:6]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_ETH_ESTAT</name>
				<description>soso</description>
				<addressOffset>0x05</addressOffset>
				<size>8</size>
				<access>read-only</access>
				<fields>
					<field>
						<name>RB_ETH_ESTAT_TXABRT</name>
						<description>soso</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ESTAT_RXBUSY</name>
						<description>soso</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ESTAT_RXMORE</name>
						<description>soso</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ESTAT_RXNIBBLE</name>
						<description>soso</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ESTAT_RXCRCER</name>
						<description>soso</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ESTAT_BUFER</name>
						<description>soso</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ESTAT_INT</name>
						<description>soso</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_ETH_ECON2</name>
				<description>soso</description>
				<addressOffset>0x06</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_ECON2_TX</name>
						<description>soso</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ECON2_RX</name>
						<description>soso</description>
						<bitRange>[3:1]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_ETH_ECON1</name>
				<description>soso</description>
				<addressOffset>0x07</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_ECON1_RXEN</name>
						<description>soso</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ECON1_TXRTS</name>
						<description>soso</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ECON1_RXRST</name>
						<description>soso</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ECON1_TXRST</name>
						<description>soso</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_ETH_ETXST</name>
				<description>soso</description>
				<addressOffset>0x08</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_ETH_ETXLN</name>
				<description>soso</description>
				<addressOffset>0x0A</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_ETH_ERXST</name>
				<description>soso</description>
				<addressOffset>0x0C</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_ETH_ERXLN</name>
				<description>soso</description>
				<addressOffset>0x0E</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register> 
			<register>
				<name>R8_ETH_EHT0</name>
				<description>soso</description>
				<addressOffset>0x10</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_EHT1</name>
				<description>soso</description>
				<addressOffset>0x11</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_EHT2</name>
				<description>soso</description>
				<addressOffset>0x12</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_EHT3</name>
				<description>soso</description>
				<addressOffset>0x13</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_EHT4</name>
				<description>soso</description>
				<addressOffset>0x14</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_EHT5</name>
				<description>soso</description>
				<addressOffset>0x15</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_EHT6</name>
				<description>soso</description>
				<addressOffset>0x16</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_EHT7</name>
				<description>soso</description>
				<addressOffset>0x17</addressOffset>
				<size>8</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_ERXFCON</name>
				<description>soso</description>
				<addressOffset>0x18</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_ERXFCON_BCEN</name>
						<description>soso</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ERXFCON_MCEN</name>
						<description>soso</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ERXFCON_HTEN</name>
						<description>soso</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ERXFCON_MPEN</name>
						<description>soso</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ERXFCON_CRCEN</name>
						<description>soso</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ERXFCON_ANDOR</name>
						<description>soso</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RB_ETH_ERXFCON_UCEN</name>
						<description>soso</description>
						<bitRange>[7:7]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_ETH_MACON1</name>
				<description>soso</description>
				<addressOffset>0x19</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_MACON1_MARXEN</name>
						<description>soso</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_ETH_MACON1_PASSALL</name>
						<description>soso</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>RB_ETH_MACON1_RXPAUS</name>
						<description>soso</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_ETH_MACON1_TXPAUS</name>
						<description>soso</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_ETH_MACON1_FCEN</name>
						<description>soso</description>
						<bitRange>[5:4]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_ETH_MACON2</name>
				<description>soso</description>
				<addressOffset>0x1A</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_MACON2_FULDPX</name>
						<description>soso</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>RB_ETH_MACON2_HFRMEN</name>
						<description>soso</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>RB_ETH_MACON2_PHDREN</name>
						<description>soso</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>RB_ETH_MACON2_TXCRCEN</name>
						<description>soso</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>RB_ETH_MACON2_PADCFG</name>
						<description>soso</description>
						<bitRange>[7:5]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_ETH_MABBIPG</name>
				<description>soso</description>
				<addressOffset>0x1B</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_MABBIPG_MABBIPG</name>
						<description>soso</description>
						<bitRange>[6:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R16_ETH_EPAUS</name>
				<description>soso</description>
				<addressOffset>0x1C</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_ETH_MAMXFL</name>
				<description>soso</description>
				<addressOffset>0x1E</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_ETH_MIRD</name>
				<description>soso</description>
				<addressOffset>0x20</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R8_ETH_MIREGADR</name>
				<description>soso</description>
				<addressOffset>0x24</addressOffset>
				<size>8</size>
				<access>read-write</access>
				<fields>
					<field>
						<name>RB_ETH_MIREGADR_MASK</name>
						<description>soso</description>
						<bitRange>[4:0]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>R8_ETH_MISTAT</name>
				<description>soso</description>
				<addressOffset>0x25</addressOffset>
				<size>8</size>
				<access>read-only</access>
			</register>
			<register>
				<name>R16_ETH_MIWR</name>
				<description>soso</description>
				<addressOffset>0x26</addressOffset>
				<size>16</size>
				<access>write-only</access>
			</register>
			<register>
				<name>R32_ETH_MAADRL</name>
				<description>soso</description>
				<addressOffset>0x28</addressOffset>
				<size>32</size>
				<access>read-write</access>
			</register>
			<register>
				<name>R16_ETH_MAADRH</name>
				<description>soso</description>
				<addressOffset>0x2C</addressOffset>
				<size>16</size>
				<access>read-write</access>
			</register>
		</registers>
	</peripheral>
</peripherals>
    <!-- <peripheral derivedFrom="TIMER0"> -->
      <!-- <name>TIMER1</name> -->
      <!-- <baseAddress>0x40010100</baseAddress> -->
      <!-- <interrupt> -->
        <!-- <name>TIMER1</name> -->
        <!-- <value>4</value> -->
      <!-- </interrupt> -->
    <!-- </peripheral> -->


    <!-- <peripheral derivedFrom="TIMER0"> -->
      <!-- <name>TIMER2</name> -->
      <!-- <baseAddress>0x40010200</baseAddress> -->
      <!-- <interrupt> -->
        <!-- <name>TIMER2</name> -->
        <!-- <value>6</value> -->
      <!-- </interrupt> -->
    <!-- </peripheral> -->
 
</device>
